schmttc/EasyThreeD-K7-STM32/EasyThreeDSupplied/mksRobinLite_nano/Drivers/BSP/STM32MKS-3dPrinter/stm32f1xx_3dprinter_uart.c
/**
  ******************************************************************************
  * @file    stm32f1xx_3dPrinter_uart.c
  * @author  IPC Rennes
  * @version V1.0.0
  * @date    January 29, 2015
  * @brief   uart functions of 3D Printer BSP driver 
  *  (based on L6474)
  * @note    (C) COPYRIGHT 2015 STMicroelectronics
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_3dprinter_uart.h"
#include "stm32f1xx_3dprinter_misc.h"
#include "stm32f10x_usart.h"
#include <string.h> /* for memcpy */
#include <stdarg.h> /* for va_start */
#include <stdio.h> /* for vsprintf */

/* Private defines -----------------------------------------------------------*/
/* Private constant ----------------------------------------------------------*/
#define UART_ERROR_TAG        (0x1000)
#define UART_ERROR(error)     BSP_MiscErrorHandler(error|UART_ERROR_TAG)

#ifdef USE_XONXOFF
#define BSP_UART_GET_NB_BYTES_IN_RX_BUFFER()  ((gBspUartData.pRxBufferRIndex <= gBspUartData.pRxBufferWIndex)? \
                                    ( (unsigned int )(gBspUartData.pRxBufferWIndex - gBspUartData.pRxBufferRIndex)): \
                                    ( (unsigned int )(gBspUartData.pRxBufferWIndex + UART_RX_BUFFER_SIZE - gBspUartData.pRxBufferRIndex)))


#define BSP_UART_GET_NB_BYTES_IN_TX_BUFFER()  ((gBspUartData.pTxBufferRIndex <= gBspUartData.pTxBufferWIndex)? \
                                    ( (unsigned int )(gBspUartData.pTxBufferWIndex - gBspUartData.pTxBufferRIndex)): \
                                    ( (unsigned int )(gBspUartData.pTxBufferWIndex + UART_TX_BUFFER_SIZE - gBspUartData.pTxBufferRIndex)))


#define BSP_UART_TX_THRESHOLD_XOFF  (UART_TX_BUFFER_SIZE / 50)
#define BSP_UART_TX_THRESHOLD_XON   (UART_TX_BUFFER_SIZE / 100)
#define BSP_UART_RX_THRESHOLD_XOFF  (UART_RX_BUFFER_SIZE / 2)
#define BSP_UART_RX_THRESHOLD_XON   (UART_RX_BUFFER_SIZE / 3)
#endif

/* Private functions ---------------------------------------------------------*/
uint8_t BSP_UartParseRxAvalaibleBytes(const char* pBuffer, uint8_t nbRxBytes);
    
extern DMA_HandleTypeDef  DMA_wifiRcv;

#ifdef USE_XONXOFF
static uint8_t  BspUartXonXoff = 0;
static uint8_t BspUartXoffBuffer[12] = " SEND XOFF\n";
static uint8_t BspUartXonBuffer[11] = " SEND XON\n";
#endif
/* Extern function -----------------------------------------------------------*/

/******************************************************//**
 * @brief  Usart Hw initialisation
 * @param None
 * @retval None
 **********************************************************/
void BSP_UartHwInit(BSP_UART_STACK *pUStack, uint32_t newBaudRate)
{
	BspUartDataType *pUart = pUStack->pUart;
	if(pUStack->id == 1)
	{
		pUart->handle.Instance = USART1;
	}
	else if(pUStack->id == 2)
	{
		pUart->handle.Instance = USART2;
	}
	else if(pUStack->id == 3)
	{
		pUart->handle.Instance = USART3;
	}
	else if(pUStack->id == 4)
	{
		pUart->handle.Instance = UART4;
	}
	else if(pUStack->id == 5)
	{
		pUart->handle.Instance = UART5;
	}
  
  
	  pUart->handle.Init.BaudRate = newBaudRate;
	  pUart->handle.Init.WordLength = UART_WORDLENGTH_8B;
	  pUart->handle.Init.StopBits = UART_STOPBITS_1;
	  pUart->handle.Init.Parity = UART_PARITY_NONE;
	  pUart->handle.Init.Mode = UART_MODE_TX_RX;
	  pUart->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	  pUart->handle.Init.OverSampling = UART_OVERSAMPLING_16;

	  if(HAL_UART_DeInit(&pUart->handle) != HAL_OK)
	  {
	    UART_ERROR(1);
	  }  

	  if( HAL_UART_Init(&pUart->handle) != HAL_OK)
	  {
	    UART_ERROR(2);
	  }
}

/******************************************************//**
 * @brief  Start the UART interface with the GUI 
 * @param None
 * @retval None
 **********************************************************/

void BSP_UartIfStart(BSP_UART_STACK *pUStack, uint8_t flag)
{
  BspUartDataType *pUart = pUStack->pUart;
 // pUart->pRxBuffer = (uint8_t *)gBspUartRxBuffer;
  pUart->pRxBufferWIndex =  pUart->pRxBuffer;
  pUart->pRxBufferRIndex =  pUart->pRxBuffer;  
 // pUart->pTxBuffer = (uint8_t *)gBspUartTxBuffer;
  pUart->pTxBufferWIndex =  pUart->pTxBuffer;
  pUart->pTxBufferRIndex =  pUart->pTxBuffer;
#if USE_MKS_USART_TX
  pUart->pTxWrap  =  pUart->pTxBuffer;
#else  
  pUart->pTxWrap  =  pUart->pTxBuffer + pUart->txBufferSize;
#endif  
  pUart->rxBusy = RESET;
  pUart->txBusy = RESET;
  pUart->debugNbTxFrames = 0;
  pUart->debugNbRxFrames = 0;
  
