schmttc/EasyThreeD-K7-STM32/EasyThreeDSupplied/mksRobinLite_nano/Drivers/BSP/STM32MKS-3dPrinter/stm32f1xx_3dprinter_uart.c
  pUart->newTxRequestInThePipe = 0;
  pUart->nbBridgedBytes = 0;
  pUart->gCodeDataMode = 0;

    if(flag & UART_INT_MODE)
    {
    		if(pUStack->id == 1)
    		{    		 	
		    HAL_NVIC_SetPriority(USART1_IRQn, 3, 0);
		    HAL_NVIC_EnableIRQ(USART1_IRQn);
		}
		else if(pUStack->id == 2)
		{
			HAL_NVIC_SetPriority(USART2_IRQn, 3, 0);
		    HAL_NVIC_EnableIRQ(USART2_IRQn);
		}
		    
		/* wait for 1 bytes on the RX uart */
		if (HAL_UART_Receive_IT(&pUart->handle, (uint8_t *)(&pUart->rxWriteChar), 1) != HAL_OK)
		{
			UART_ERROR(3);
		}  
		
    }
    /* if(flag & UART_DMA_MODE)
    {
    		
		__HAL_RCC_DMA1_CLK_ENABLE();

		HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 0, 0);
	 	HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);

		DMA_wifiRcv.Instance = DMA1_Channel6;
		DMA_wifiRcv.Init.Direction = DMA_PERIPH_TO_MEMORY;
		DMA_wifiRcv.Init.PeriphInc = DMA_PINC_DISABLE;
		DMA_wifiRcv.Init.MemInc = DMA_MINC_ENABLE;
		DMA_wifiRcv.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		DMA_wifiRcv.Init.MemDataAlignment = DMA_PDATAALIGN_BYTE;
		DMA_wifiRcv.Init.Mode = DMA_NORMAL;
		DMA_wifiRcv.Init.Priority = DMA_PRIORITY_VERY_HIGH;
		if (HAL_DMA_Init(&DMA_wifiRcv) != HAL_OK)
		{
		  Error_Handler();
		}	

		__HAL_LINKDMA(&pUart->handle, hdmarx, DMA_wifiRcv);
    }*/

  pUart->rxBusy = SET;
}

/******************************************************//**
 * @brief  Queue tx data to be sent on the UART
 * @param[in]  pBuf pointer to the data to be sent
 * @param[in]  nbData number of bytes to be sent
 * @retval None
 **********************************************************/
void BSP_UartIfQueueTxData(BSP_UART_STACK *pUStack, uint8_t *pBuf, uint8_t nbData)
{
  if (nbData != 0)
  {
    BspUartDataType *pUart = pUStack->pUart;  
    
    int32_t nbFreeBytes = pUart->pTxBufferRIndex - pUart->pTxBufferWIndex;
       
    if (nbFreeBytes <= 0)
    {
      nbFreeBytes += pUart->txBufferSize;
    }
    if (nbData > nbFreeBytes)
    {
        /* Uart Tx buffer is full */
        UART_ERROR(4);
    }
    
    //use of memcpy is safe as real buffer size is 2 * pUart->txBufferSize
    memcpy((uint8_t *)pUart->pTxBufferWIndex, pBuf, nbData);
    pUart->pTxBufferWIndex += nbData;
    
    if (pUart->pTxBufferWIndex >= pUart->pTxBuffer + pUart->txBufferSize - 10)
    {
      pBuf[nbData-1] = '\n';    //预防字符串太长
    }
      
#if defined(MARLIN)
    if(pUStack->id == 1)
    {
	    if (pBuf[nbData-1] == '\n')
	    {
	      *pUart->pTxBufferWIndex = '\n';
	      pUart->pTxBufferWIndex--;
	      *pUart->pTxBufferWIndex = '\r';
	      pUart->pTxBufferWIndex += 2;
	      if (pUart->pTxBufferWIndex >= pUart->pTxBuffer + pUart->txBufferSize)
	      {
	        pUart->pTxWrap = pUart->pTxBufferWIndex; 
	        pUart->pTxBufferWIndex = pUart->pTxBuffer;
	      }
	      //BSP_UartIfSendQueuedData();  // BDI
	    }
	 }
	 
#else
    ABC
    if (pUart->pTxBufferWIndex >= pUart->pTxBuffer + pUart->txBufferSize)
    {
      pUart->pTxWrap = pUart->pTxBufferWIndex; 
      pUart->pTxBufferWIndex = pUart->pTxBuffer;
    }
#endif
    BSP_UartIfSendQueuedData(pUStack);
//#endif
  }
}
   
/******************************************************//**
 * @brief  Send queued data to the GUI
 * @param None
 * @retval None
 **********************************************************/
void BSP_UartIfSendQueuedData(BSP_UART_STACK *pUStack)
{
    BspUartDataType *pUart = pUStack->pUart;  
    int i;
#ifdef USE_XONXOFF    
    if ((pUart->newTxRequestInThePipe == 0)&&
        (pUart->txBusy == RESET))
    {    
      if ((BspUartXonXoff == 2)||
      ((BSP_UART_GET_NB_BYTES_IN_TX_BUFFER()  > BSP_UART_TX_THRESHOLD_XOFF) && (BspUartXonXoff == 0)))
      {
        pUart->txBusy = SET;
        pUart->nbTxBytesOnGoing = 0;
        BspUartXoffBuffer[0] = 0x13;
        if (HAL_UART_Transmit_IT(&pUart->handle, (uint8_t *)&BspUartXoffBuffer, sizeof(BspUartXoffBuffer))!= HAL_OK)
        {
          UART_ERROR(10);
        }
        BspUartXonXoff = 3;
        return;
      }
      else if ((BspUartXonXoff == 1)||
        ((BSP_UART_GET_NB_BYTES_IN_RX_BUFFER()  < BSP_UART_RX_THRESHOLD_XON) && (BspUartXonXoff == 3)&& (BSP_UART_GET_NB_BYTES_IN_TX_BUFFER() < BSP_UART_TX_THRESHOLD_XON)))
      {
        pUart->txBusy = SET;
        pUart->nbTxBytesOnGoing = 0;
        BspUartXonBuffer[0] = 0x11;
        if (HAL_UART_Transmit_IT(&pUart->handle, (uint8_t *)&BspUartXonBuffer, sizeof(BspUartXonBuffer))!= HAL_OK)
        {
          UART_ERROR(11);
        } 
        BspUartXonXoff = 0;
        return;
      }
    }
#endif
    if ((pUart->newTxRequestInThePipe == 0)&&
        (pUart->txBusy == RESET)&&
        (pUart->pTxBufferRIndex != pUart->pTxBufferWIndex))
    {
      int32_t nbTxBytes = pUart->pTxBufferWIndex - pUart->pTxBufferRIndex;
      pUart->newTxRequestInThePipe++;
      if (nbTxBytes < 0)
      {
        nbTxBytes = pUart->pTxWrap - pUart->pTxBufferRIndex;
      }
      
#if defined(MARLIN)
      if (pUart->pTxBufferRIndex[nbTxBytes-1]!='\n')
      {
        pUart->newTxRequestInThePipe--;
        return;
      }
#endif
      pUart->txBusy = SET;
      pUart->nbTxBytesOnGoing = nbTxBytes;       

#if USE_MKS_USART_TX
/*-------------mode 1 begin---------------------*/
	// Send one byte from USART
      for(i=0;i<nbTxBytes;i++)
      {
        USART_SendData(pUart->handle.Instance, *pUart->pTxBufferRIndex++);
	// Loop until USART DR register is empty
	while(USART_GetFlagStatus(pUart->handle.Instance, USART_FLAG_TXE) == RESET){}
      }
      
      pUart->txBusy = RESET;
      pUart->nbTxBytesOnGoing = 0;
      pUart->pTxBufferRIndex = (uint8_t *)pUart->pTxBuffer;
      pUart->pTxBufferWIndex = pUart->pTxBufferRIndex;
      
/*-------------mode 1 end---------------------*/   
#else  
      ABC
/*-------------mode 2 begin---------------------*/     
        //use of HAL_UART_Transmit_IT is safe as real buffer size is 2 * pUart->txBufferSize
     
      if(HAL_UART_Transmit_IT(&pUart->handle, (uint8_t *) pUart->pTxBufferRIndex, nbTxBytes)!= HAL_OK)
      {
        UART_ERROR(5);
      }
#if USE_MKS_USART_TX      
      HAL_Delay(1);     
      while(pUart->handle.State == HAL_UART_STATE_BUSY_TX_RX);    //skyblue modidy 2017-03-15
#endif
       
/*-------------mode 2 end---------------------*/ 
#endif      
      
      pUart->debugNbTxFrames++;
      pUart->newTxRequestInThePipe--;
    }
}


