schmttc/EasyThreeD-K7-STM32/EasyThreeDSupplied/mksRobinLite_nano/Drivers/BSP/STM32MKS-3dPrinter/stm32f1xx_3dprinter_uart.c
/*Directly send data, without queue*/
void BSP_UartIfTxData(BSP_UART_STACK *pUStack, uint8_t *pBuf, uint32_t nbData)
{
	BspUartDataType *pUart = pUStack->pUart;  
	uint32_t i;
	#if 1
	for(i=0;i<nbData;i++)
      {
	        USART_SendData(pUart->handle.Instance, *(pBuf+i));
		// Loop until USART DR register is empty
		while(USART_GetFlagStatus(pUart->handle.Instance, USART_FLAG_TXE) == RESET){}
      }
      #else
      HAL_UART_Transmit(&pUart->handle, pBuf, nbData, 1000);
      #endif
}

/******************************************************//**
 * @brief  Tx Transfer completed callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/
void HAL_UART_TxCpltCallback(BspUartDataType *pUart)
{  
//  if (UartHandle == &(pUart->handle))
  {
    /* Set transmission flag: transfer complete*/
    pUart->txBusy = RESET;
    
#ifdef USE_XONXOFF
    if ((BspUartXonXoff == 2)||
        ((BSP_UART_GET_NB_BYTES_IN_TX_BUFFER()  > BSP_UART_TX_THRESHOLD_XOFF) && (BspUartXonXoff == 0)))
    {
      pUart->txBusy = SET;
      BspUartXoffBuffer[0] = 0x13;
      if (HAL_UART_Transmit_IT(&pUart->handle, (uint8_t *)&BspUartXoffBuffer, sizeof(BspUartXoffBuffer))!= HAL_OK)
      {
        UART_ERROR(10);
      }
      BspUartXonXoff = 3;
      return;
    }
    else if ((BspUartXonXoff == 1)||
        ((BSP_UART_GET_NB_BYTES_IN_RX_BUFFER()  < BSP_UART_RX_THRESHOLD_XON) && (BspUartXonXoff == 3)&& (BSP_UART_GET_NB_BYTES_IN_TX_BUFFER() < BSP_UART_TX_THRESHOLD_XON)))
    {
      pUart->txBusy = SET;
      BspUartXonBuffer[0] = 0x11;
      if (HAL_UART_Transmit_IT(&pUart->handle, (uint8_t *)&BspUartXonBuffer, sizeof(BspUartXonBuffer))!= HAL_OK)
      {
        UART_ERROR(11);
      } 
      BspUartXonXoff = 0;
      return;
    }
#endif
#if USE_MKS_USART_TX
  pUart->nbTxBytesOnGoing = 0;
  pUart->pTxBufferRIndex = (uint8_t *) pUart->pTxBuffer;
  pUart->pTxBufferWIndex = pUart->pTxBufferRIndex;
#else      
    pUart->pTxBufferRIndex += pUart->nbTxBytesOnGoing;
    
    if (pUart->pTxBufferRIndex >= pUart->pTxBuffer + pUart->txBufferSize)
    {
      pUart->pTxBufferRIndex  = pUart->pTxBuffer;
    }          
#endif    
    if (pUart->uartTxDoneCallback != 0)
    {
      pUart->uartTxDoneCallback();
    }
  }
}

/******************************************************//**
 * @brief  Rx Transfer completed callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/
extern volatile uint8_t mks_heating_busy;
void HAL_UART_RxCpltCallback( BspUartDataType *pUart)
{
/*  
  mks_heating_busy	
  //等待加热完成，不接受指令
*/
  
//  if (UartHandle == &(pUart->handle))
  {

   
	
    if(!mks_heating_busy)
    {
    	    uint8_t *tmpWIndex = (uint8_t *)pUart->pRxBufferWIndex;
	    tmpWIndex = (tmpWIndex + 1 >= (pUart->pRxBuffer + pUart->rxBufferSize)) ? (uint8_t *)pUart->pRxBuffer : tmpWIndex + 1;
	    if(tmpWIndex != pUart->pRxBufferRIndex)
	    {
	    	*pUart->pRxBufferWIndex = pUart->rxWriteChar;
	    	pUart->pRxBufferWIndex = tmpWIndex;
	    }		
      
    }
    
    if (HAL_UART_Receive_IT(&pUart->handle, (uint8_t *)(&pUart->rxWriteChar), 1) != HAL_OK)
    {
      UART_ERROR(6);
    }

    
#ifdef USE_XONXOFF    
    if ((BSP_UART_GET_NB_BYTES_IN_RX_BUFFER()  > BSP_UART_RX_THRESHOLD_XOFF) && (BspUartXonXoff == 0))
    {
      BspUartXonXoff = 2;
    }
    else if ((BSP_UART_GET_NB_BYTES_IN_RX_BUFFER()  < BSP_UART_RX_THRESHOLD_XON) && (BspUartXonXoff == 3)&& (BSP_UART_GET_NB_BYTES_IN_TX_BUFFER() <BSP_UART_TX_THRESHOLD_XON))
    {
      BspUartXonXoff = 1;
    }
#endif    
    if (pUart->pRxBufferWIndex == pUart->pRxBufferRIndex && mks_heating_busy == 0)
    {
      // Rx buffer is full 
      UART_ERROR(7);
    }    
    
    if (pUart->uartRxDataCallback != 0)
    {
      pUart->uartRxDataCallback((uint8_t *)pUart->pRxBufferRIndex,pUart->pRxBufferWIndex - pUart->pRxBufferRIndex);
    }
    pUart->debugNbRxFrames++;
  }
}

/******************************************************//**
 * @brief  Uart Error callback
 * @param[in] UartHandle UART handle. 
 * @retval None
 **********************************************************/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    UART_ERROR(8);
}

/******************************************************//**
 * @brief  Attaches a callback which will be called when
 * a complete rx uart buffer is ready
 * @param[in] callback Name of the callback to attach 
 * @retval None
 **********************************************************/
void BSP_UartAttachRxDataHandler(BSP_UART_STACK *pUStack, void (*callback)(uint8_t *, uint8_t))
{
  BspUartDataType *pUart = pUStack->pUart;  
  pUart->uartRxDataCallback = (void (*)(uint8_t *, uint8_t))callback;
}

/******************************************************//**
 * @brief  Attaches a callback which will be called when
 * a complete tx uart buffer is ready
 * @param[in] callback Name of the callback to attach 
 * @retval None
 **********************************************************/
void BSP_UartAttachTxDoneCallback(BSP_UART_STACK *pUStack, void (*callback)(void))
{
  BspUartDataType *pUart = pUStack->pUart;  
  pUart->uartTxDoneCallback = (void (*)(void))callback;
}


/******************************************************//**
 * @brief  This function trigs the transmission of a string over the UART 
 *             for printing
 * @param[in] format string with formatting
 * @param[in]  Optional arguments to fit with formatting
 * @retval Lengthj of the string to print (uint32_t)
 **********************************************************/
uint32_t BSP_UartPrintf(BSP_UART_STACK *pUStack, const char* format,...)
{
  BspUartDataType *pUart = pUStack->pUart;  
  va_list args;
   uint32_t size;
  uint32_t retSize = 0;
  int32_t nbFreeBytes = pUart->pTxBufferRIndex - pUart->pTxBufferWIndex;
  
  if (nbFreeBytes <= 0)
  {
    nbFreeBytes += pUart->txBufferSize;
  }  
  
  char *writeBufferp =(char *) pUart->pTxBufferWIndex;
  /* the string to transmit is copied in the temporary buffer in order to    */
  /* check its size.                                                         */
  va_start(args, format);
  size=vsprintf(writeBufferp, (const char*)format, args);
  va_end(args);
   
  retSize = size;   
  if (*(writeBufferp + size - 1) == '\n')
  {
    *(writeBufferp + size - 1) = '\r';
    *(writeBufferp + size) = '\n';
    size++;
  }
  if (size != 0)
  {
    if ( size > nbFreeBytes )
    {
      UART_ERROR(9);
    }
    pUart->pTxBufferWIndex += size;
    if (pUart->pTxBufferWIndex >= pUart->pTxBuffer + pUart->txBufferSize)
    {
      pUart->pTxWrap = pUart->pTxBufferWIndex; 
      pUart->pTxBufferWIndex  = pUart->pTxBuffer;
    }
      
    BSP_UartIfSendQueuedData(pUStack);
  }
  return(retSize);  
}

/******************************************************//**
 * @brief  This function returns the number of bytes received via the UART
 * @param[in] fnone
  * @retval nxRxBytes nb received bytes
 **********************************************************/
uint32_t BSP_UartGetNbRxAvalaibleBytes(BSP_UART_STACK *pUStack)
{
  BspUartDataType *pUart = pUStack->pUart;  
  uint8_t *writePtr = (uint8_t *)(pUart->pRxBufferWIndex - 1);
  
  if (writePtr < pUart->pRxBuffer)
  {
    writePtr += pUart->rxBufferSize;
  }  
  
  //waitline feed to have a complete line before processing bytes
  if ((int8_t)(*writePtr) != 0XA)
    return (0);
  
  int32_t nxRxBytes = pUart->pRxBufferWIndex - pUart->pRxBufferRIndex;
  if (nxRxBytes < 0)
  {
    nxRxBytes += pUart->rxBufferSize;
  }
#if !defined(MARLIN)
  if (nxRxBytes != 0)
  {
    uint8_t result = BSP_UartParseRxAvalaibleBytes((char const*)pUart->pRxBufferRIndex, nxRxBytes);
    if (result < BSP_WIFI_THRES_TO_GCODE_PARSER)
    {
      //The available bytes will not to go into the Gcode parser
      pUart->pRxBufferRIndex += nxRxBytes;
      nxRxBytes = 0; 
      if (pUart->pRxBufferRIndex >= (pUart->pRxBuffer + pUart->rxBufferSize))
      {
        pUart->pRxBufferRIndex = pUart->pRxBuffer;
      }
    }
  }
#endif
  
  return ((uint32_t) nxRxBytes );
}

/******************************************************//**
 * @brief  This function returns the number of bytes received via the UART
 * @param[in] fnone
  * @retval nxRxBytes nb received bytes
 **********************************************************/
/*
uint8_t BSP_UartParseRxAvalaibleBytes(const char* pBuffer, uint8_t nbRxBytes)
{
  return (BSP_WifiParseTxBytes(pBuffer, nbRxBytes, BSP_WIFI_SOURCE_IS_DEBUG_UART));
}
*/
/******************************************************//**
 * @brief  This function returns the first byte available on the UART
 * @param[in] none
 * @retval byteValue (0-0X7F)  or -1 if no byte is available
 **********************************************************/
int8_t BSP_UartGetNextRxBytes(BSP_UART_STACK *pUStack)
{
  BspUartDataType *pUart = pUStack->pUart;  
  int8_t byteValue;

