schmttc/EasyThreeD-K7-STM32/EasyThreeDSupplied/mksRobinLite_nano/Drivers/BSP/STM32MKS-3dPrinter/stm32f1xx_3dprinter_uart.c
  uint8_t *writePtr = (uint8_t *)(pUart->pRxBufferWIndex);
  
 /* if (writePtr < pUart->pRxBuffer)
  {
    writePtr += pUart->rxBufferSize;
  }*/  
  
  if (pUart->pRxBufferRIndex != writePtr)
  {
    byteValue = (int8_t)(*(pUart->pRxBufferRIndex));
    pUart->pRxBufferRIndex++;

    if (pUart->pRxBufferRIndex >= (pUart->pRxBuffer + pUart->rxBufferSize))
    {
      pUart->pRxBufferRIndex = pUart->pRxBuffer;
    } 
  }
  else
  {
    byteValue = -1;
  }
  
  return (byteValue);
}

/*
Read %len bytes from uart rx fifo
*/
int32_t BSP_UartGetNRxBytes (BSP_UART_STACK *pUStack, uint8_t *buf, uint32_t len )
{
	BspUartDataType *pUart = pUStack->pUart;  
	uint32_t i = 0;
	uint8_t *writePtr = (uint8_t *)(pUart->pRxBufferWIndex);
	uint8_t *readPtr = (uint8_t *)(pUart->pRxBufferRIndex);

	/*  if (writePtr < pUart->pRxBuffer)
	  {
	    writePtr += pUart->rxBufferSize;
	  }  */
	
	while(i < len)
	{
		readPtr = (uint8_t *)(pUart->pRxBufferRIndex);
		if (readPtr != writePtr)
		{
			buf[i] = (int8_t)(*(pUart->pRxBufferRIndex));
			pUart->pRxBufferRIndex++;

			if (pUart->pRxBufferRIndex >= (pUart->pRxBuffer + pUart->rxBufferSize))
			{
				pUart->pRxBufferRIndex = pUart->pRxBuffer;
			} 
			i++;				
		}
		else
		{
			break;
		}
	}
	return i;
}

/******************************************************//**
 * @brief  Returns if there is a pending TX request in the UART
 * @param[in] none
 * @retval 0 if no pending TX request in the UART
 **********************************************************/
uint8_t BSP_UartIsTxOnGoing(BSP_UART_STACK *pUStack)
{
  BspUartDataType *pUart = pUStack->pUart; 
  return (pUart->newTxRequestInThePipe||pUart->txBusy);
}

#if defined(MARLIN)
/******************************************************//**
 * @brief  This function calls the WIFI TX parser and returns 0 when the command 
   in the buffer is not destinated to the gcode parser
 * @param[in] pBuf pointer to the buffer holding the command
 * @retval number of bytes destinated to the gcode parser
 **********************************************************/
/*
uint32_t BSP_UartCommandsFilter(char *pBufCmd, uint8_t nxRxBytes)
{
  if (BSP_UartParseRxAvalaibleBytes((char const*)pBufCmd, nxRxBytes)\
        < BSP_WIFI_THRES_TO_GCODE_PARSER)
  {
    nxRxBytes = 0; 
  }
  return nxRxBytes;  
}
*/
#endif

/******************************************************//**
 * @brief  This function sends data via the Uart in locking
 * mode (no interrupt used).
 * It should not be used except by the Error handler
 * @param[in]  pBuf pointer to the data to be sent
 * @param[in]  nbData number of bytes to be sent
 * @retval None
 **********************************************************/

void BSP_UartLockingTx(BSP_UART_STACK *pUStack, uint8_t *pBuf, uint8_t nbData)
{
   BspUartDataType *pUart = pUStack->pUart;  
  
    HAL_UART_Transmit(&pUart->handle, pBuf, nbData, 1000);
}

void BSP_UartFlushRx(BSP_UART_STACK *pUStack)
{
	BspUartDataType *pUart = pUStack->pUart;
	uint32_t tmp_flag = 0;  
	
	 tmp_flag = __HAL_UART_GET_FLAG(&pUart->handle, UART_FLAG_RXNE);
	  /* UART in mode Receiver ---------------------------------------------------*/
	  while(tmp_flag != RESET)
	  { 
	    	pUart->handle.Instance->DR;
		tmp_flag = __HAL_UART_GET_FLAG(&pUart->handle, UART_FLAG_RXNE);
	   
	  }
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

